web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_Alcohol_v12.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v12">
   <SOAP-ENV:Body>
      <ProcessShipmentRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key></Key>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber></AccountNumber>
            <MeterNumber></MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC01_USUS_E01011_HOLD AT LOC_POS</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>12</Major>
            <Intermediate>1</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2012-08-17T11:08:04-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>PRIORITY_OVERNIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <PreferredCurrency>USD</PreferredCurrency>
            <Shipper>
               <Contact>
                  <PersonName>2_U_M_T_D_E_PO_YP_P</PersonName>
                  <CompanyName>CSCS-API</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Test Address Line 1-Sender</StreetLines>
                  <StreetLines>Test Address Line 2-Sender</StreetLines>
                  <City>Collierville</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38017</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>CSCS WAPI Recp</PersonName>
                  <CompanyName>WAPI-RECIPIENT</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Recipient Address Line 1</StreetLines>
                  <City>AUSTIN</City>
                  <StateOrProvinceCode>TX</StateOrProvinceCode>
                  <PostalCode>73301</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber></AccountNumber>
                     <Contact>
                        <PersonName>2_U_M_T_D_E_PO_YP_P</PersonName>
                        <CompanyName>CSCS-API</CompanyName>
                        <PhoneNumber>1234567890</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Test Address Line 1-Sender</StreetLines>
                        <StreetLines>Test Address Line 2-Sender</StreetLines>
                        <City>Collierville</City>
                        <StateOrProvinceCode>TN</StateOrProvinceCode>
                        <PostalCode>38017</PostalCode>
                        <CountryCode>US</CountryCode>
                     </Address>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <LabelSpecification>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
               <LabelStockType>PAPER_4X6</LabelStockType>
            </LabelSpecification>
            <RateRequestTypes>ACCOUNT</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
               <CustomerReferences>
                  <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                  <Value>$AW</Value>
               </CustomerReferences>
               <SpecialServicesRequested>
                  <SpecialServiceTypes>ALCOHOL</SpecialServiceTypes>
                  <SpecialServiceTypes>SIGNATURE_OPTION</SpecialServiceTypes>
                  <SignatureOptionDetail>
                     <OptionType>ADULT</OptionType>
                  </SignatureOptionDetail>
               </SpecialServicesRequested>
</RequestedPackageLineItems>
         </RequestedShipment>
      </ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>